Tekla Open API Reference for Tekla Structures 2025
Picker.PickPoint Method (String)
 Requests the user to pick one point. Returns the picked point in the view coordinates and the view in which the pick occurred.
 Namespace: Tekla.Structures.Drawing.UI
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Tuple<Point, ViewBase> PickPoint(
	string prompt
)
Public Function PickPoint (
	prompt As String
) As Tuple(Of Point, ViewBase)
Parameters
prompt
Type: System.String
The prompt shown in the status bar. See the class remarks for more information about prompts.
Return Value
Type: Tuple<Point, ViewBase>
[Missing <returns> documentation for "M:Tekla.Structures.Drawing.UI.Picker.PickPoint(System.String)"]
Exceptions
Exception | Condition
InvalidPluginPickerInputException |  Thrown when the picker is being used through a plug-in which has invalid PluginPickerInputs defined.
PickerInterruptedException |  Thrown when the user interrupts the picker before anything has been picked.
See Also
Reference
Picker Class
PickPoint Overload
Tekla.Structures.Drawing.UI Namespace